#include <stdio.h> //کتابخانه ورودی/خروجی (مثل printf و scanf)
#include <stdlib.h> //کتابخانه استاندارد (برای تابع rand() و srand() لازمه)
#include <time.h> //برای استفاده از تابع time() که بتونیم عدد تصادفی واقعی داشته باشیم
int main() //شروع تابع اصلی برنامه
{
    srand(time(0)); //این خط باعث میشه هر بار که برنه رو اجرا کنی عدد تصادفی متفاوتی تولید بشه
    //time(0) زمان فعلی رو به ثانیه برمی‌گردونه و srand اون رو به‌عنوان «دانه» (seed) برای تولید اعداد تصادفی استفاده می‌کنه.
    int s=rand()%100+1,g,t=0; //سه متغییر تغیین شده
  //s: عدد مخفی که کامپیوتر انتخاب می‌کنه → rand() % 100 یه عدد از 0 تا 99 می‌ده، با +1 می‌شه 1 تا 100
   //g: حدس کاربر (بعداً با scanf پر می‌شه)
  //t = 0: شمارنده تعداد حدس‌ها (trial)
   printf("عدد 1-100 رو حدس بزن!\n"); //پیام خوش‌آمدگویی
    do{printf("حدست: ");
        scanf("%d",&g); //عدد وارد شده توسط کاربر رو می‌خونه و توی متغیر g ذخیره می‌کنه.
        //علامت & یعنی آدرس حافظه g رو بده تا مقدار اونجا نوشته بشه.
        t++; //تعداد حدس‌ها رو یکی زیاد می‌کنه (هر بار که وارد حلقه می‌شیم)
        if(g<s)printf("بالاتر\n"); //اگر حدست کمتر از عدد مخفی بود، می‌گه «بالاتر»
        else if(g>s)printf("پایین‌تر\n"); //اگر بیشتر بود، می‌گه «پایین‌تر»
    }while(g!=s); //حلقه ادامه پیدا می‌کنه تا وقتی که g برابر s بشه (یعنی درست حدس بزنی). وقتی درست حدس زدی، شرط g != s غلط می‌شه و حلقه تموم می‌شه
    printf("آفرین! %d حدس\n",t); //تبریک می‌گه و تعداد حدس‌ها رو نشون می‌ده
    return 0; //برنامه با موفقیت تموم شد (صفر یعنی بدون خطا)
} //پایان تابع main
